app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2018-04-09 22:06:41.839243"], ["updated_at", "2018-04-09 22:06:41.839243"]]
---
  def create
	Post.create(title: params[:post][:title], description: params[:post][:description])